ExprovipFuel/src/Reports/ВзаиморасчетыСКлентами/ВзаиморасчетыСКлентами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ВзаиморасчетыСКлентами</name>
</mdclass:Report>

ExprovipFuel/src/AccumulationRegisters/ВзаиморасчетыКлиенты/ВзаиморасчетыКлиенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчетыКлиенты</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаТранзакции</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ExprovipFuel/src/Reports/ВзаиморасчетыСКлентами/Forms/ФормаОтчета/Module.bsl
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ВыгрузитьНаСайт(Команда)
	ВыгрузитьНаСайтНаСервере();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВыгрузитьНаСайтНаСервере()
	ДатаЗапроса = ТекущаяДатаСеанса();
	
	Для Каждого ЭлементНастроек Из Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		Если Не ЭлементНастроек.Использование Тогда
			Продолжить;
		КонецЕсли;	
		Если СокрЛП(ЭлементНастроек.Параметр) = "Период" Тогда
			ДатаЗапроса = ЭлементНастроек.Значение.ДатаОкончания;
		КонецЕсли;	 
	КонецЦикла;	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаЗапроса", ДатаЗапроса);
	Запрос.Текст = "ВЫБРАТЬ
	|	&ДатаЗапроса,
	|	ВзаиморасчетыКлиентыОстатки.Контрагент КАК Контрагент,
	|	ВзаиморасчетыКлиентыОстатки.Валюта КАК Валюта,
	|	ВзаиморасчетыКлиентыОстатки.СуммаОстаток КАК Сумма,
	|	ВзаиморасчетыКлиентыОстатки.Контрагент.Логин КАК Логин
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыКлиенты.Остатки(&ДатаЗапроса,) КАК ВзаиморасчетыКлиентыОстатки
	|ИТОГИ
	|	МАКСИМУМ(Логин) КАК Логин
	|ПО
	|	Контрагент";
	
	ВыборкаКонтрагент = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Контрагент");
	Счетчик = 0;
	Пока ВыборкаКонтрагент.Следующий() Цикл
		ТаблицаКлиента = ТаблицаОстатковКлиентаШаблон();
		ВыборкаДетальныеЗаписи = ВыборкаКонтрагент.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НоваяСтрока = ТаблицаКлиента.Добавить();
			НоваяСтрока.Валюта = ВыборкаДетальныеЗаписи.Валюта;
			НоваяСтрока.Дата = Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy;");
			НоваяСтрока.Сумма = Формат(ВыборкаДетальныеЗаписи.Сумма, "ЧДЦ=2; ЧРД=.; ЧГ=0;");			
		КонецЦикла;
		Попытка
			ИмяФайлаВыгрузки = Exprovip.СформироватьИмяФайла(ВыборкаКонтрагент.Логин, "balance\balance", "csv");
			Exprovip.ВыгрузитьТаблицуВCSV(ТаблицаКлиента, ";", ИмяФайлаВыгрузки);
			
			Счетчик = Счетчик + 1;
		Исключение
			Сообщение = СтрШаблон("Ошибка выгрузки %1. Ошибка: %2", ВыборкаКонтрагент.Контрагент, ОписаниеОшибки());
			ОбщегоНазначения.СообщитьПользователю(Сообщение);
		КонецПопытки;				 
	КонецЦикла;
	Если Счетчик > 0 Тогда
		Сообщение = СтрШаблон("Выгружено успешно: %1 клиентов", Счетчик);
		ОбщегоНазначения.СообщитьПользователю(Сообщение);
	КонецЕсли;	
КонецПроцедуры

// Таблица остатков клиента.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица остатков клиента:
// * Дата - Строка - 
// * Валюта - Строка - 
// * Сумма - Строка 
&НаСервере
Функция ТаблицаОстатковКлиентаШаблон()
	ТаблицаЗначений = Новый ТаблицаЗначений();
	ТаблицаЗначений.Колонки.Добавить("Дата", Новый ОписаниеТипов("Строка"));
	ТаблицаЗначений.Колонки.Добавить("Валюта", Новый ОписаниеТипов("Строка"));
	ТаблицаЗначений.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Строка"));
	
	Возврат ТаблицаЗначений;
КонецФункции	
#КонецОбласти
